Tekla Open API Reference for Tekla Structures 2025
ConnectionBase.InputObjectType Enumeration
 Defines the input object type.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum InputObjectType
Public Enumeration InputObjectType
Members
Member name | Value | Description
INPUTOBJECT_PART | 0 |  The input object is a part instance.
INPUTOBJECT_CUSTOMPART | 1 |  The input object can be a custom part (component).
See Also
Reference
Tekla.Structures.Plugins Namespace